Autodesk.Revit.DB.InsertOrientation
The allowed values for the INSERT_ORIENTATION parameter.

Autodesk.Revit.DB.InsertOrientation.Interior
Insert is aligned with the Tapered wall's interior face.

Autodesk.Revit.DB.InsertOrientation.Exterior
Insert is aligned with the Tapered wall's exterior face.

Autodesk.Revit.DB.InsertOrientation.Slanted
Insert is aligned with the Slanted wall's slant direction.

Autodesk.Revit.DB.InsertOrientation.Vertical
Insert is vertical regardless of the wall's slant.